{"pages":[{"title":"About","date":"2019-06-11T18:29:32.881Z","path":"about/index.html","text":""},{"title":"Tags","date":"2019-06-11T18:29:32.882Z","path":"tags/index.html","text":""},{"title":"Categories","date":"2019-06-11T18:29:32.882Z","path":"categories/index.html","text":""}],"posts":[{"title":"correct_cea_orientation","date":"2019-06-13T21:00:07.000Z","path":"wiki/correct-cea-orientation/","text":"Overview The cea data has mis-orientated before 09/2013. We have the document of how these stations are mis-orientated. (From Prof. Kai Tao and by Prof. Fenglin Niu) Dr. Chen has some data that have been processed before. So I'd like to compare the cmpaz of her processed data and the document mentioned above. Result The data from the document has the form 1#NET|STA|NO.EVENT|MEAN|STD|MEDIAN|MAD|STARTTIME|ENDTIME AH.BAS 1AH|BAS|130|8.46|10.14|10.23|4.50|2008-03-11T14:37:00Z|2010-04-11T09:40:00Z cmpaz = 1.000000e+01 AH.BEB 1AH|BEB|113|-4.82|20.58|-7.31|8.67|2007-10-02T03:43:00Z|2011-01-13T16:16:00Z cmpaz = -7.000000e+00 AH.DYN 1AH|DYN|101|66.71|6.26|66.86|3.83|2007-08-27T17:11:00Z|2008-11-03T19:21:00Z cmpaz = 6.500000e+01 AH.FZL 123456789#NET=AH,STA=FZL,MINCC=0.80,XYFILE=AH.FZL.XY#NET|STA|NO.EVENT|MEAN|STD|MEDIAN|MAD|STARTTIME|ENDTIMEAH|FZL|3|-39.87|38.49|-60.75|3.94|2007-08-08T17:04:00Z|2007-08-15T20:22:00ZAH|FZL|18|-20.44|29.88|-30.98|16.20|2007-09-12T11:10:00Z|2008-03-26T20:06:00ZAH|FZL|3|3.09|87.01|14.27|103.34|2008-04-02T14:36:00Z|2008-04-10T04:29:00ZAH|FZL|1|3.69|NA|3.69|0.00|2008-04-29T19:10:00Z|2008-04-29T19:10:00ZAH|FZL|327|3.04|11.37|1.71|7.47|2008-05-02T01:33:00Z|2013-09-01T11:52:00ZAH|FZL|0|NA|NA|NA|NA|NA|2013-09-01T11:52:00ZAH|FZL||||||2013-09-01T11:52:00Z|NULL cmpaz = -1.000000e+00 Here we don't have the data of the for the event 200804161919A. AH.HBE 1AH|HBE|64|13.63|5.46|13.70|3.91|2007-08-01T17:08:00Z|2008-06-10T04:13:00Z AH.HEF 1AH|HEF|58|-9.22|5.11|-9.29|3.71|2007-10-31T13:44:00Z|2010-02-01T22:28:00Z cmpaz = -9.000000e+00 AH.HSH 1AH|HSH|108|-183.73|12.04|-180.53|5.63|2007-09-12T23:49:00Z|2010-05-27T17:14:00Z cmpaz = -1.790000e+02 AH.HUS 1AH|HUS|59|-4.29|4.56|-4.26|2.56|2007-08-01T17:08:00Z|2008-07-06T01:00:00Z cmpaz = 0.000000e+00 AH.JZA 1AH|JZA|96|0.13|16.51|2.94|9.54|2007-08-08T17:04:00Z|2010-03-05T16:07:00Z cmpaz = 1.000000e+00 Conclusion It seems the mis-orientation data that Dr. Chen has used is slightly different from Dr. Tao has used. But they are similar to each other, only several degrees different.","tags":[{"name":"cea","slug":"cea","permalink":"wiki.ziyixi.science/tags/cea/"}],"categories":[{"name":"Research note","slug":"Research-note","permalink":"wiki.ziyixi.science/categories/Research-note/"}]},{"title":"Comparision of different filters in preprocessing data","date":"2019-06-11T21:07:03.000Z","path":"wiki/taper/","text":"Filters In the seismic research, we have to preprocess the data. Specially in the field of FWI, we may have to compare the synthetics and the data, and then calculate the misfit function. Here I compare two different way to get our desired frequency range. Bandpass The data we have the data and the PZ file. And then we can use SAC to preprocess it: 1234r AH.DYN.BHZ.trimrmean; rtr; taper;trans from polezero s ./AH.DYN.BHZ.pz to none freq 0.004 0.005 1 1.2bp n 2 p 2 c 0.01 0.0025 So here we will get the processed data with the frequency range of 40s to 100s. Taper in the frequency domain We can also directly get the final result as: 123r AH.DYN.BHZ.trimrmean; rtr; taper;trans from polezero s ./AH.DYN.BHZ.pz to none freq 0.008 0.01 0.025 0.03 Result We can compare the result as: As we can see, the black line represents &quot;taper from 0.004HZ to 0.005HZ&quot; and then removing the instrumental response, while the blue line represents &quot;taper from 0.01HZ to 0.0025HZ&quot; and then removing the instrumental response. And the red line represnets apply a bandpass filter from 0.01HZ to 0.0025HZ to the black line. In FWI research, we want to keep as much as energy in our desired frequency band. So it seems the blue has not losed the energy, which is better then the red line. Also the blue line has almost the same amount of enery with the red line. However, there is an abrupt jump of the blue line, which may cause some artifact. Look at part from 800s to 1000s. It seems the &quot;phases&quot; in the black line are the artifact, which may cause some problem for the comparision of the surface wave. Anyway, the behavior of sync and data outside our desired frequency range is somehow different.","tags":[{"name":"filter","slug":"filter","permalink":"wiki.ziyixi.science/tags/filter/"}],"categories":[{"name":"DSP","slug":"DSP","permalink":"wiki.ziyixi.science/categories/DSP/"}]},{"title":"SeisScript","date":"2019-06-11T21:07:03.000Z","path":"wiki/SeisScript/","text":"Overview Recently I have collected some of my research scripts into a package (or just a directory) named SeisScript. This package is very useful for the need of full waveform inversion in the study of seismology. Here I'd like to introduce different parts. specfem_helper.jl At the moment, this package contains two different usable programs. (and more usable functions!) They are all inside the src/program subdirectory. Before using them, we may have to enter the fortran directory to run julia compile.jl to compile two fortran files into the dynamic library so that we can use ccall to call them. (I can write them in pure Julia, but I'm pretty lazy.) Also we have to edit setting/constants.jl to edit ANGULAR_WIDTH_XI_IN_DEGREES_VAL, ANGULAR_WIDTH_ETA_IN_DEGREES_VAL, NEX_XI_VAL and NEX_ETA_VAL. The first program is named as xsem_interp_mesh2.jl, direcctly adapted from Tao Kai's code. But I have used some packages directly from Julia which makes the code more neat and more beautiful. According to my test, this program will have the same result with Tao's code, but three time slower. (That's reasonable, since Julia seems to be slower than Fortran, but I'm planning to precompile some parts to make it faster.) The second program is named as get_cross_section_data.jl. This program is mainly used to calculated the point values along a specific profile of the GLL model. Previously we have a script which is designed to find the nearest points along the interface of the profile. This method is somehow not accurate. So I'm using the interpolation to calculate the values. Comparing with the previous code, this program runs faster and uses less computing resources.","tags":[{"name":"FWI","slug":"FWI","permalink":"wiki.ziyixi.science/tags/FWI/"}],"categories":[{"name":"FWI","slug":"FWI","permalink":"wiki.ziyixi.science/categories/FWI/"}]},{"title":"所思所想","date":"2019-06-11T18:49:41.000Z","path":"wiki/index/","text":"这是我的个人 Wiki,用以记录一些零碎的知识。或者是一些系统性的总结。在学习和科研的过程中，我常常感觉到很多东西需要加以注意，但总是没有一个合适的渠道将它们记录下来。我个人不是非常很喜欢 OneNote 之类的工具，因为它并不能帮忙建立一个知识网络，从而把知识沟通起来，由点及线以至于网。","tags":[],"categories":[]}]}