{"pages":[{"title":"Categories","date":"2019-06-11T18:29:32.882Z","path":"categories/index.html","text":""},{"title":"Tags","date":"2019-06-11T18:29:32.882Z","path":"tags/index.html","text":""},{"title":"About","date":"2019-06-11T18:29:32.881Z","path":"about/index.html","text":""}],"posts":[{"title":"SeisScript","date":"2019-06-11T21:07:03.000Z","path":"wiki/Summary/FWI/SeisScript/","text":"Overview Recently I have collected some of my research scripts into a package (or just a directory) named SeisScript. This package is very useful for the need of full waveform inversion in the study of seismology. Here I'd like to introduce different parts. specfem_helper.jl At the moment, this package contains two different usable programs. (and more usable functions!) They are all inside the src/program subdirectory. Before using them, we may have to enter the fortran directory to run julia compile.jl to compile two fortran files into the dynamic library so that we can use ccall to call them. (I can write them in pure Julia, but I'm pretty lazy.) Also we have to edit setting/constants.jl to edit ANGULAR_WIDTH_XI_IN_DEGREES_VAL, ANGULAR_WIDTH_ETA_IN_DEGREES_VAL, NEX_XI_VAL and NEX_ETA_VAL. The first program is named as xsem_interp_mesh2.jl, direcctly adapted from Tao Kai's code. But I have used some packages directly from Julia which makes the code more neat and more beautiful. According to my test, this program will have the same result with Tao's code, but three time slower. (That's reasonable, since Julia seems to be slower than Fortran, but I'm planning to precompile some parts to make it faster.) The second program is named as get_cross_section_data.jl. This program is mainly used to calculated the point values along a specific profile of the GLL model. Previously we have a script which is designed to find the nearest points along the interface of the profile. This method is somehow not accurate. So I'm using the interpolation to calculate the values. Comparing with the previous code, this program runs faster and uses less computing resources.","tags":[],"categories":[{"name":"Summary","slug":"Summary","permalink":"wiki.ziyixi.science/categories/Summary/"},{"name":"FWI","slug":"Summary/FWI","permalink":"wiki.ziyixi.science/categories/Summary/FWI/"}]},{"title":"所思所想","date":"2019-06-11T18:49:41.000Z","path":"wiki/index/","text":"这是我的个人 Wiki,用以记录一些零碎的知识。或者是一些系统性的总结。在学习和科研的过程中，我常常感觉到很多东西需要加以注意，但总是没有一个合适的渠道将它们记录下来。我个人不是非常很喜欢 OneNote 之类的工具，因为它并不能帮忙建立一个知识网络，从而把知识沟通起来，由点及线以至于网。","tags":[],"categories":[]}]}